package scala.scala1.homework
object Main {
  def main(args: Array[String]): Unit = {
    // TODO: Объявите переменную `variable` типа Int и присвойте ей значение 10

    // TODO: Объявите константу `constant` типа Int и присвойте ей значение 20

    // TODO: Выполните арифметические операции (сложение, вычитание, умножение, деление) с переменными `variable` и `constant`

    // TODO: Используйте логические и сравнительные операторы для переменных `variable` и `constant`

    // TODO: Выведите результаты на экран с помощью функции println

    // TODO: Напишите функцию для вычисления квадрата числа

    // TODO: Используйте функцию `square` для вычисления квадрата `variable` и `constant` и выведите результаты

    // TODO: Создайте массив из 5 целых чисел и вычислите их сумму и среднее значение

    // TODO: Напишите условное выражение, которое проверяет, является ли `variable` положительным, отрицательным или нулем
  }
}